app/controllers/questions_controller.rb

  def show
    id = params[:id]
    @question = Question.find(id)
    @answers = Answer.all
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "answers".* FROM "answers"

  def create
    Question.create(title: params[:title], content: params[:content])
---
INSERT INTO "questions" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdf"], ["content", "[:content]"], ["created_at", "2017-10-07 17:55:11.110674"], ["updated_at", "2017-10-07 17:55:11.110674"]]